{
  "backend/main.mo": "Main backend actor implementing user profile management and leaderboard score submission with role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for the Assembly game including drive mode toggle, WASD controls, third-person camera, vehicle physics, and build/drive mode separation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files covering routing, authentication, game implementations (Snake, Pong, Breakout, Cookie Clicker, Assembly), UI components, and React Query hooks.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for consistent design tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Arcade Browser application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for catalog, play, and help pages, wrapped in ThemeProvider with ProfileSetupDialog overlay.",
  "frontend/src/components/Auth/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout flow with loading states and query cache clearing on logout.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "Modal dialog prompting authenticated users without profiles to enter a display name, preventing dismissal until completed.",
  "frontend/src/components/GameCanvas.tsx": "Main game canvas component managing lifecycle for 2D canvas games (Snake, Pong, Breakout, Cookie Clicker) and 3D React Three Fiber games (Assembly) with centralized keyboard handling, game loop integration, and UI controls.",
  "frontend/src/components/GameControlsOverlay.tsx": "Dialog component that displays game-specific keyboard controls for Snake, Pong, Breakout, and other games using badges and descriptions.",
  "frontend/src/components/Layout/AppLayout.tsx": "Main layout wrapper component that renders the site header, footer, and main content area with arcade-themed background styling.",
  "frontend/src/components/LeaderboardPanel.tsx": "Card component showing local best score and allowing authenticated users to submit scores to the global leaderboard via Internet Identity.",
  "frontend/src/components/ScoreSummary.tsx": "Card component displaying current score and personal best score, automatically saving new high scores to local storage.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying copyright year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header component with arcade logo, site title, help link, and login button navigation.",
  "frontend/src/data/gamesCatalog.ts": "Defines GameMetadata interface and exports catalog array of five games (Snake, Pong, Breakout, Cookie Clicker, Mechanical Assembly) with metadata including thumbnails and controls.",
  "frontend/src/games/assembly/AssemblyGame.ts": "Core game engine for 3D mechanical assembly game implementing GameEngine interface with build and drive modes, physics simulation, collision detection, scoring, and multiplayer support.",
  "frontend/src/games/assembly/AssemblyGameCanvas.tsx": "React Three Fiber canvas component managing AssemblyGame lifecycle with 3D scene rendering, raycasting for part dragging, camera controls, and game state UI including menu, level selection, and gameplay.",
  "frontend/src/games/assembly/components/AssemblyUI.tsx": "HUD overlay component displaying time remaining, assembly progress, mistakes count, and drive mode controls with support for multiplayer player indicators.",
  "frontend/src/games/assembly/components/LevelSelector.tsx": "Displays a grid of assembly game levels with lock status, difficulty badges, best scores, and selection buttons. Integrates with progress storage to show unlocked levels and player achievements.",
  "frontend/src/games/assembly/components/ModeSelector.tsx": "Provides a two-card UI for selecting between single-player and local multiplayer game modes with icons and descriptions.",
  "frontend/src/games/assembly/components/Part3DComponent.tsx": "Renders a 3D box mesh for an assembly part with material coloring, selection highlighting, and drag opacity effects.",
  "frontend/src/games/assembly/components/PartsInventory.tsx": "Displays available assembly parts in a scrollable horizontal list at the bottom of the screen, allowing part selection during build mode.",
  "frontend/src/games/assembly/components/ProgressResetButton.tsx": "Provides a confirmation dialog button to clear all assembly game progress including levels, scores, and unlocks.",
  "frontend/src/games/assembly/components/ThirdPersonCamera.tsx": "Implements a smooth third-person camera that follows a vehicle target with lerp interpolation and dynamic positioning based on rotation.",
  "frontend/src/games/assembly/levels.ts": "Defines three assembly levels (simple vehicle, robot arm, mechanical drone) with increasing difficulty, each specifying required parts, connections, time limits, and descriptions.",
  "frontend/src/games/assembly/materials.ts": "Provides Three.js material presets (metallic, plastic, rubber, highlight, error, transparent) and helper functions to assign materials based on part type and color.",
  "frontend/src/games/assembly/scoring.ts": "Calculates assembly game scores based on correct placements, time bonuses, accuracy bonuses, and mistake penalties with detailed breakdown.",
  "frontend/src/games/assembly/types.ts": "Defines TypeScript interfaces for 3D points, parts, connections, assembly levels, game modes, vehicle physics, and multiplayer state.",
  "frontend/src/games/assembly/utils/collisionDetection.ts": "Provides utilities for 3D distance calculation, finding nearest connection points with snap distance, checking part-connection compatibility, and snapping parts to connection points.",
  "frontend/src/games/assembly/utils/vehiclePhysics.ts": "Implements vehicle physics simulation including acceleration, braking, turning, velocity updates with friction and drift, and position/rotation updates based on wheel count.",
  "frontend/src/games/assembly/utils/vehicleValidation.ts": "Provides utility functions for validating vehicle assemblies, including checking for a chassis, counting wheels, calculating center of mass, and computing bounding boxes from placed 3D parts.",
  "frontend/src/games/breakout/BreakoutGame.ts": "Implements a Breakout game engine with paddle control, ball physics, brick collision detection, scoring, and win/lose conditions.",
  "frontend/src/games/cookieclicker/CookieClickerGame.ts": "Implements a Cookie Clicker idle game with manual clicking, auto-production upgrades, multiplier upgrades, particle effects, scrolling UI, and persistent state storage.",
  "frontend/src/games/engine/useGameLoop.ts": "Custom React hook that manages a requestAnimationFrame-based game loop with delta time calculation, start/stop controls, and stable callback references.",
  "frontend/src/games/pong/PongGame.ts": "Implements a Pong game engine with player paddle control, AI opponent, ball physics, collision detection, and scoring.",
  "frontend/src/games/snake/SnakeGame.ts": "Implements a Snake game engine with grid-based movement, food collection, collision detection, score tracking, and game over conditions.",
  "frontend/src/games/types.ts": "Defines TypeScript interfaces for game state and the GameEngine contract that all game implementations must follow.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and game scores via the backend actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, arcade-style utilities including background patterns and title styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a grid of playable games from the catalog with thumbnails, descriptions, and control badges, linking to individual game pages.",
  "frontend/src/pages/HelpPage.tsx": "Help documentation page explaining browser-based gameplay, keyboard controls, score tracking, and available games with a link to the catalog.",
  "frontend/src/pages/PlayGamePage.tsx": "Game player page that renders the GameCanvas component for a specific game ID from the catalog, with navigation back to the catalog.",
  "frontend/src/storage/assemblyProgressStorage.ts": "LocalStorage utilities for managing Assembly game progression including unlocked levels, completed levels, and level scores.",
  "frontend/src/storage/cookieClickerStorage.ts": "LocalStorage persistence layer for Cookie Clicker game state including cookies, upgrades, multipliers, and timestamps.",
  "frontend/src/storage/localHighScores.ts": "LocalStorage utilities for saving and retrieving per-game best scores with a prefixed key scheme.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme colors using OKLCH color space, typography, container queries, animations (accordion), and custom font families (Inter, Courier New).",
  "project_state.json": "Project state tracking file documenting a 3D vehicle building game with completed features including drive mode toggle, WASD controls, third-person camera, physics system, and build/drive mode switching mechanics."
}