{
  "backend/main.mo": "Main Motoko actor implementing user profile management and leaderboard score submission with role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: WASD+arrow key support for Snake and Breakout games, and updated GameControlsOverlay to display both control schemes.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/TSX files including game implementations, UI components, hooks, and utilities with focus on dual WASD/arrow key control support.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Arcade Browser application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for catalog, play, and help pages, wrapped in ThemeProvider with ProfileSetupDialog overlay.",
  "frontend/src/components/Auth/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout flow with loading states and query cache clearing on logout.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "Modal dialog prompting authenticated users without profiles to enter a display name, blocking dismissal until completed.",
  "frontend/src/components/GameCanvas.tsx": "Main game canvas component managing game lifecycle, centralized keyboard input handling with focus management, game loop integration, error handling, and UI controls for start/restart/pause.",
  "frontend/src/components/GameControlsOverlay.tsx": "Dialog component displaying detailed keyboard controls for each game, showing both WASD and arrow key mappings with action descriptions.",
  "frontend/src/components/Layout/AppLayout.tsx": "Layout wrapper component providing consistent structure with header, main content area with arcade background, and footer.",
  "frontend/src/components/LeaderboardPanel.tsx": "React component that displays local best score and provides authenticated users the ability to submit scores to a global leaderboard, with submission state management and authentication prompts.",
  "frontend/src/components/ScoreSummary.tsx": "React component that displays current score and personal best score for a game, automatically saving new personal bests to local storage.",
  "frontend/src/components/SiteFooter.tsx": "Simple footer component displaying copyright year and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/SiteHeader.tsx": "Site header with logo, title, navigation links to help page, and login button, using sticky positioning with backdrop blur.",
  "frontend/src/data/gamesCatalog.ts": "Defines game metadata interface and exports a catalog array containing metadata for three games: Snake, Pong, and Breakout, including thumbnails, descriptions, and controls.",
  "frontend/src/games/breakout/BreakoutGame.ts": "Implements the Breakout game engine with paddle control, ball physics, brick collision detection, and scoring, following the GameEngine interface.",
  "frontend/src/games/engine/useGameLoop.ts": "Custom React hook that manages a requestAnimationFrame-based game loop with delta time calculation, providing start/stop controls and capping frame time to prevent large jumps.",
  "frontend/src/games/pong/PongGame.ts": "Implements the Pong game engine with player paddle control, AI opponent logic, ball physics, collision detection, and scoring.",
  "frontend/src/games/snake/SnakeGame.ts": "Implements the Snake game engine with grid-based movement, food placement, collision detection for walls and self, and score tracking.",
  "frontend/src/games/types.ts": "Defines TypeScript interfaces for game state and the GameEngine contract that all game implementations must follow.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes and admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and game scores via the backend actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors using OKLCH color space, arcade-style utilities, and background patterns.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a grid of available games from the catalog with thumbnails, descriptions, and control badges, linking to individual game pages.",
  "frontend/src/pages/HelpPage.tsx": "Help documentation page explaining browser-based gameplay, keyboard controls, score tracking, and game-specific control references.",
  "frontend/src/pages/PlayGamePage.tsx": "Game player page that renders the GameCanvas component for a specific game ID from the catalog, with navigation back to the catalog.",
  "frontend/src/storage/localHighScores.ts": "LocalStorage utility functions for persisting and retrieving best scores per game on the client side.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking dual control scheme implementation (WASD + arrow keys) across a multi-game arcade. Snake, Breakout, and controls overlay are complete; Pong update is pending."
}